Revit 2026 API

# IExportContextOnPolymesh Method

---

This method is called when a tessellated polymesh of a 3d face is being output.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
void OnPolymesh(
	PolymeshTopology node
)
```
```vb
Sub OnPolymesh (
	node As PolymeshTopology
)
```
```cpp
void OnPolymesh(
	PolymeshTopology^ node
)
```
```fsharp
abstract OnPolymesh :
        node : PolymeshTopology -> unit
```

#### Parameters

node PolymeshTopology
     A node representing topology of the polymesh

#### Reference

IExportContext Interface

Autodesk.Revit.DB Namespace